In [3]:
# Pandas is for data analysis
# Pandas offer 2 data type. Series (one dimensional level array) and DataFrames
# Offer a no of data exploration
# Pandas made from numpy and scipy 
# Helps to generate Descriptive Statistics
# Helps in data cleaning

In [5]:
import pandas as pd

In [7]:
#ser = pd.Series (['100','300','5000',900,800],[200,450,'Ramu','Haresh','Nitesh'])
ser = pd.Series (['a','b','c','d','e'],[1,2,3,4,5])

In [9]:
#1st column output is index
ser

1    a
2    b
3    c
4    d
5    e
dtype: object

In [11]:
#Shows the id or index of series
ser.index

Index([1, 2, 3, 4, 5], dtype='int64')

In [13]:
#show location in series
ser.loc[[1]]

1    a
dtype: object

ser.loc[[3]]

In [17]:
#another way of finding location in series
ser[[1]]

1    a
dtype: object

In [19]:
ser[[1,4,5]]

1    a
4    d
5    e
dtype: object

In [21]:
ser.loc[[3,4,5]]

3    c
4    d
5    e
dtype: object

In [23]:
ser.iloc[0]

'a'

In [25]:
ser.iloc[3]

'd'

In [29]:
ser.loc[[1]]

1    a
dtype: object

In [31]:
#you can manimulate string by multiplying as well
ser.loc[[1]]*5

1    aaaaa
dtype: object

# Data Frame

In [34]:
a = {'one':pd.Series([10,20,30,40,50]),
        'two':pd.Series([-10,-20,-30,-40,-50])
    }

In [36]:
df=pd.DataFrame(a)

In [38]:
print(df)

   one  two
0   10  -10
1   20  -20
2   30  -30
3   40  -40
4   50  -50

In [40]:
b = {'one':pd.Series([10,20,30,40,50], index=['a','b','c','d','e']),
        'two':pd.Series([-10,-20,-30,-40,-50], index=['na','nb','nc','nd','ne'])
    }

In [44]:
abc=pd.DataFrame(b)

In [46]:
print(abc)

     one   two
a   10.0   NaN
b   20.0   NaN
c   30.0   NaN
d   40.0   NaN
e   50.0   NaN
na   NaN -10.0
nb   NaN -20.0
nc   NaN -30.0
nd   NaN -40.0
ne   NaN -50.0

In [48]:
c = {'one':pd.Series([10,20,30,40,50], index=['a','b','c','d','e']),
        'two':pd.Series([-10,-20,-30,-40,-50], index=['a','b','c','d','e'])
    }

In [50]:
xyz=pd.DataFrame(c)

In [62]:
print(xyz)

   one  two
a   10  -10
b   20  -20
c   30  -30
d   40  -40
e   50  -50

In [64]:
xyz

   one  two
a   10  -10
b   20  -20
c   30  -30
d   40  -40
e   50  -50

In [66]:
xyz.loc['d']

one    40
two   -40
Name: d, dtype: int64

In [68]:
xyz.iloc[3]

one    40
two   -40
Name: d, dtype: int64

In [72]:
m = {'english':pd.Series([90,23,35,40,50], index=['avi','bishal','chan','dro','ellle']),
        'math':pd.Series([60,80,30,20,90], index=['avi','bishal','chan','dro','ellle']),
         'science':pd.Series([50,60,70,40,100], index=['avi','bishal','chan','dro','ellle'])
    }

In [74]:
mno=pd.DataFrame(m)

In [78]:
mno

        english  math  science
avi          90    60       50
bishal       23    80       60
chan         35    30       70
dro          40    20       40
ellle        50    90      100

In [84]:
mno.loc[['avi']]

     english  math  science
avi       90    60       50

In [90]:
mno.loc['avi']

english    90
math       60
science    50
Name: avi, dtype: int64

In [92]:
#mno['avi']
#not working

In [112]:
'''n = {'english':pd.Series([90,23,35,40,50]),
        'math':pd.Series([60,80,30,20,90]),
         'science':pd.Series([50,60,70,40,100])
    }'''

"n = {'english':pd.Series([90,23,35,40,50]),\n        'math':pd.Series([60,80,30,20,90]),\n         'science':pd.Series([50,60,70,40,100])\n    }"

In [108]:
no = pd.DataFrame({
    'english': [90, 23, 35, 40, 50],
    'math': [60, 80, 30, 20, 90],
    'science': [50, 60, 70, 40, 100]
}, index=['avi', 'bishal', 'chan', 'dro', 'ellle'])

In [110]:
no

        english  math  science
avi          90    60       50
bishal       23    80       60
chan         35    30       70
dro          40    20       40
ellle        50    90      100

In [162]:
#another way
q = {'english':([90,23,35,40,50,80,90,99,89]),
        'math':([60,80,30,20,95,70,77,89,90]),
         'science':([50,60,70,40,100,56,55,66,70])
    }
marks=pd.DataFrame(q,index=['avi','bishal','chan','dro','ellle','sita','gita','sarita','sabin'])

In [164]:
marks

        english  math  science
avi          90    60       50
bishal       23    80       60
chan         35    30       70
dro          40    20       40
ellle        50    95      100
sita         80    70       56
gita         90    77       55
sarita       99    89       66
sabin        89    90       70

In [116]:
data=[{'ram':100,'Shyam':200},{'ema':50,'ramu':80}]

In [118]:
df1=pd.DataFrame(data)

In [120]:
df1

     ram  Shyam   ema  ramu
0  100.0  200.0   NaN   NaN
1    NaN    NaN  50.0  80.0

In [122]:
df2=pd.DataFrame(data,index=['First number','Second Number'])

In [124]:
df2

                 ram  Shyam   ema  ramu
First number   100.0  200.0   NaN   NaN
Second Number    NaN    NaN  50.0  80.0

In [126]:
#Just only pull necessary columns
df3=pd.DataFrame(data,columns=['ram','ema'])

In [128]:
df3

     ram   ema
0  100.0   NaN
1    NaN  50.0

In [138]:
p = {'english':([90,23,35,40,50,80,90,99,89]),
        'math':([60,80,30,20,95,70,77,89,90]),
         'science':([50,60,70,40,100,56,55,66,70])
    }
marks=pd.DataFrame(p,index=['avi','bishal','chan','dro','ellle','sita','gita','sarita','sabin'])

In [140]:
marks

        english  math  science
avi          90    60       50
bishal       23    80       60
chan         35    30       70
dro          40    20       40
ellle        50    95      100
sita         80    70       56
gita         90    77       55
sarita       99    89       66
sabin        89    90       70

# Head & Tail

In [142]:
type(marks)

pandas.core.frame.DataFrame

In [154]:
#Only display top 5
marks.head()

        english  math  science
avi          90    60       50
bishal       23    80       60
chan         35    30       70
dro          40    20       40
ellle        50    95      100

In [156]:
#Only display bottom 5
marks.tail()

        english  math  science
ellle        50    95      100
sita         80    70       56
gita         90    77       55
sarita       99    89       66
sabin        89    90       70

In [158]:
#see top 8 values
marks.head(8)

        english  math  science
avi          90    60       50
bishal       23    80       60
chan         35    30       70
dro          40    20       40
ellle        50    95      100
sita         80    70       56
gita         90    77       55
sarita       99    89       66

In [160]:
marks.tail(8)

        english  math  science
bishal       23    80       60
chan         35    30       70
dro          40    20       40
ellle        50    95      100
sita         80    70       56
gita         90    77       55
sarita       99    89       66
sabin        89    90       70